:PROPERTIES:
:ID: 924633e4-e663-42f8-b496-3f2439e8fd70
:END:
#+title: Subscriptions
#+description: Subscriptions
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:events:
#+created: 2026-05-21
#+updated: 2026-05-21

List active subscriptions.

#+name: events-subscriptions
#+begin_src ores-shell :exports none
events subscriptions
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<events-subscriptions>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> No active subscriptions.
ores-shell> Bye!
#+end_example
